<!--NEXT Раздел "Изменения, благодаря терапии"-->
<template>
<div class="col-md-12 b-odd i-8 goal-changes">
  <div class="row">
    <div class="col-md-2"></div>
    <div class="col-md-8">
      <h1>Какой станет твоя жизнь благодаря терапии?</h1>
      <ul class="dash">
        <li>научишься лучше понимать себя и свои отношения с миром</li>
        <li>получишь алгоритм выхода из со-зависимого состояния</li>
        <li>сможешь выбирать отношения без игр в треугольник жертва-спасатель-агрессор</li>
        <li>уйдут чувства тревоги, страха, чувство вины и стыда</li>
        <li>станешь себе другом и поддержкой</li>
        <li>перестанешь цепляться за отношения, в которых ты одинок и покинут</li>
        <li>ощущение "дыры" в душе утихнет, ты научишься удовлетворять свои потребности</li>
        <li>ты сможешь выбирать себя, и чтобы не случилось быть на своей стороне</li>
      </ul>
    </div>
    <div class="col-md-2"></div>
  </div>
</div>
</template>