<!--NEXT Раздел "Стоимость"-->
<template>
<div class="col-md-12 b-odd container-section">
  <div>
    <h1 class="t-9 text-center title">Стоимость услуг</h1>
    <div class="row">
      <div class="col-md-1"></div>
      <div class="col-md-4 block">
        <h1 class="text-center">Первичная консультация</h1>
        <ul>
          <li>На первой встрече я знакомлюсь, задаю вопросы, для меня важно услышать, с чем ты пришел, как устроена твоя жизнь</li>
          <li>
            Мне тоже можно задавать вопросы, это помогает снять напряжение ибо ты не на допросе. Диалог помогает развеять ожидания и страхи о терапии или того, что, терапевт- безупречный человек лишенный эмоций, препарирующий всех как лягушку взглядом
          </li>
          <li>
            Мы обсудим, чего бы тебе хотелось от наших встреч и на основании того, что ты предъявляешь о себе, учитывая запрос, я предложу возможный формат работы
          </li>
          <li>Также мы обсудим границы наших отношений и график дальнейших встреч</li>
        </ul>
        <h2 class="text-center">3500руб / 50 мин</h2>
      </div>
      <div class="col-md-2"></div>
      <div class="col-md-4 block">
        <h1 class="text-center">Долгосрочная терапия</h1>
        <ul>
          <li>Если ты решил работать со своей со-зависимостью и выбрал меня своим терапевтом, моя задача организовать стабильные терапевтические отношения</li>
          <li>Поэтому, я беру в терапию клиентов только с постоянным сеттингом</li>
          <li>Постоянный сеттинг это встречи в назначенный день и время четыре раза в месяц</li>
          <li>
            Постоянство необходимо для установления доверия в отношениях, поддержания механизмов психики связанных с сопротивлением и формированием нейронных связей. Это помогает регулировать количество и обеспечивает качество моей работы
          </li>
          <li>
            Терапия это самое ценное, долгосрочное вложение в твою жизнь, и оно не измеримо ни с чем. Твои результаты остаются с тобой и работают на тебя в отличие от платьев и прочих временных атрибутов благополучия пожизненно
          </li>
        </ul>
        <h2 class="text-center">14 000руб / 4 встречи</h2>
      </div>
    </div>
  </div>
</div>
</template>
<style scoped>
  .title{padding-bottom:40px;font-size:2.4rem;}
  .block {background: #efefef;padding:20px 15px 5px;border-radius:20px;}
  h1{font-size:1.5rem;font-weight:bold;padding:10px 0;}
  h2{font-size:1.3rem;font-weight:bold;padding:5px 0 30px;}
</style>
