<!--NEXT Раздел "Стоимость"-->
<template>
<div class="col-12 s-container">
  <div>
    <h1 class="s-title">Стоимость услуг</h1>
    <div class="row">
      <div class="col-lg-6">
        <div class="block">
          <h1 class="variant">Первичная консультация</h1>
          <ul>
            <li>На первой встрече я знакомлюсь, задаю вопросы, для меня важно услышать, с чем ты пришел, как устроена твоя жизнь</li>
            <li>
              Мне тоже можно задавать вопросы, это помогает снять напряжение ибо ты не на допросе. Диалог помогает развеять ожидания и страхи о терапии или того, что, терапевт- безупречный человек лишенный эмоций, препарирующий всех как лягушку взглядом
            </li>
            <li>
              Мы обсудим, чего бы тебе хотелось от наших встреч и на основании того, что ты предъявляешь о себе, учитывая запрос, я предложу возможный формат работы
            </li>
            <li>Также мы обсудим границы наших отношений и график дальнейших встреч</li>
          </ul>
          <h2 class="text-center">3500руб / 50 мин</h2>
        </div>
      </div>
      <div class="col-lg-6">
        <div class="block">
          <h1 class="variant">Долгосрочная терапия</h1>
          <ul>
            <li>Если ты решил работать со своей со-зависимостью и выбрал меня своим терапевтом, моя задача организовать стабильные терапевтические отношения</li>
            <li>Поэтому, я беру в терапию клиентов только с постоянным сеттингом</li>
            <li>Постоянный сеттинг это встречи в назначенный день и время четыре раза в месяц</li>
            <li>
              Постоянство необходимо для установления доверия в отношениях, поддержания механизмов психики связанных с сопротивлением и формированием нейронных связей. Это помогает регулировать количество и обеспечивает качество моей работы
            </li>
            <li>
              Терапия это самое ценное, долгосрочное вложение в твою жизнь, и оно не измеримо ни с чем. Твои результаты остаются с тобой и работают на тебя в отличие от платьев и прочих временных атрибутов благополучия пожизненно
            </li>
          </ul>
          <h2 class="text-center">14 000руб / 4 встречи</h2>
        </div>
      </div>
    </div>
  </div>
</div>
</template>
<style scoped>
  .s-title{padding-bottom:20px;}
  .block {background: #efefef;margin:20px 10%;padding:20px 15px 5px;border-radius:20px;}
  h1.variant{font-size:1.7rem;font-weight:bold;text-align:center;padding:10px 0 20px;}
  h2{font-size:1.3rem;font-weight:bold;padding:5px 0 30px;}
  li{margin-bottom:7px;}
</style>
