<!--NEXT Раздел "Обо мне"-->
<template>
	<div class="col-12 muted s-container">
		<div class="row">
			<div class="col-12 col-lg-1"></div>
		  <div class="col-12 col-lg-5">
		    <h1 class="s-title">Курс «ОКЕАН ЭМОЦИЙ»</h1>
		    <div class="list">
		    	Этот курс для тех, кто либо проглатывает эмоции, либо не сдерживает себя ни в чем:<br>
			    <ul class="square cd">
			      <li>Боитесь своих эмоций и не знайте как обходиться с ними?</li>
			      <li>Часто ваши действия определяют настроение, а не здравый смысл?</li>
			      <li>Находитесь в постоянном эмоциональном напряжении?</li>
			    </ul>
		    </div>
			    <button class="btn btn-primary" type="button" @click="open_menu('general')">
			      Узнать о курсе
			    </button>
			    <button class="btn btn-primary btn2" @click="" type="button" @click="open_menu('menu')">
			      "Меню" курса
			    </button>
			    <button class="btn btn-danger" type="button" @click="open_menu('costs')">
			      Стоимость
			    </button>
		    <div class="collapse_container">  
			    <div class="collapse" id="course_general">
			      <div class="card card-body">
							Привычно пытаешься сдержать свои эмоции, но потом ощущаешь усталость, подавленность, неудовлетворенность и даже обиду и злость. 
							<br><br>
							Ты замыкаешься в себе и уже не знаешь как иначе.<br>
							Бывает и так, что ты можешь не сдерживать эмоций: их становится в секунду очень много, и ты взрываешься, кричишь, ругаешься, а потом мучаешься от вины и стыда.
							<br><br>
							Иногда, ты думаешь, что твои сильные эмоции разжигают огонь отношений, но со временем остаются одни угли из боли и разочарования.<br>
							Возможно, иногда ты замираешь и не знаешь, что сказать, теряешься, ощущаешь себя глупо и неловко. 
							<br><br>
							Ты либо проглатываешь эмоции, либо не сдерживаешь себя ни в чем. 
							<br><br>
							Тебе кажется, что ты такой эмоциональный никому не нужен и тебя все осуждают, поэтому отворачиваешься от мира.
							<br><br>
							<b>Итог один:</b> ты чувствуешь дискомфорт и мир кажется тебе враждебным полным непонимания и несправедливости.
							<br><br>
							<b>Что же делать?</b>
							Как научиться понимать свои эмоции и регулировать их без вреда для себя и своих отношений?<br>
							Как улучшить ситуацию в отношениях с помощью эмоций?<br>
							Как ты можешь повлиять на свои эмоции?
							<br><br>
							Именно для работы с эмоциями я создала авторский курс «Океан эмоций» где собрала свои знания и опыт, которые накопились у меня за 15 лет психологической практики.
			      </div>
		      </div>
		      <div class="collapse" id="course_menu">
			      <div class="card card-body">
							<b>За 2 недели курса ты сможешь:</b>
							<ul class="square top">
								<li>получить инструменты по работе со сложными эмоциями такими как: страх, обида, злость и другими важными переживаниями</li>
								<li>поймешь природу своих эмоций</li>
								<li>узнаешь способы их регулирования</li>
								<li>сформулируешь новое поддерживающее себя эмоциональное поведение</li>
								<li>ощутишь опору внутри и силы влиять на свою жизнь</li>
								<li>сможешь устанавливать границы в отношениях благодаря способности понимать эмоциональные сигналы</li>
								<li>почувствуешь поддержку со стороны участников и кураторов курса</li>
							</ul>
							<b>В результате ты научишься:</b>
							<ul class="square top">
								<li>понимать и распознавать свои эмоции</li>
								<li>быть в контакте со своими эмоциями</li>
								<li>понимать что эмоции делают для вас</li>
								<li>останавливать нежелательные эмоции</li>
								<li>снижать интенсивность эмоций и их продолжительность</li>
								<li>снижать эмоциональную уязвимость в отношениях</li>
								<li>быстрее восстанавливаться после трудных ситуаций</li>
								<li>управлять сильными эмоциями</li>
							</ul>
							<b>Из чего состоит курс:</b>
							1. Знакомство с природой твоих эмоций
							<ul class="square">
								<li>какую роль играют эмоции в твоей жизни</li>
								<li>схема эмоционального цикла</li>
								<li>разберем мифы об эмоциях</li>
								<li class="homework"><i>Домашнее задание:</i><br>
								поможет тебе выработать здоровое отношение к эмоциям и ощутить, что ты способна изменить свои эмоциональные реакции</li>
							</ul>
							2. Изучаем эмоции и чувства
							<ul class="square">
								<li>какие чувства бывают и как их можно использовать для жизни</li>
								<li>устанавливаем контакт со своими чувствами</li>
								<li>ищем негативные установки относительно чувств</li>
								<li class="homework"><i>Домашнее задание:</i><br>
										Поможет тебе устанавливать контакт с чувствами и понимать их значение, тем самым создать опору и уверенность  внутри. Работаем с недоверием к себе. 
								</li>
							</ul>
							3. Ищем баланс между установками из головы и чувствами
							<ul class="square">
								<li>учимся определять разницу между мыслями и чувствами</li>
								<li>формируем ясные границы между моими чувствами и поступками других</li>
								<li>определяем, что хорошо для вас и учимся выражать экологично</li>
							</ul>
							4. Обнаруживаем проекции
							<ul class="square">
								<li>определяем, что вы не можете принять в себе</li>
								<li>что раздражает в других</li>
								<li>учимся видеть причины сильных чувств</li>
								<li>выстраиваем здоровое взаимодействие с отверженными частями своей личности</li>
							</ul>
							5. Исследуем глубины океана эмоций
							<ul class="square">
								<li>обнаруживаем интроекты (установки)</li>
								<li>определяем , что из интроектов оставляем для дальнейшей жизни, а с чем прощаемся</li>
								<li>учимся брать только то, что нам подходит и нам помогает с радостью:))</li>
							</ul>
							6. Самый мощный модуль: работаем с эмоциями через сценарий жертва-спасатель-агрессор
							<ul class="square">
								<li>ты увидишь как роли треугольника создают динамику в твоей самооценке вниз-вверх, я дам модели выхода из эмоционального круга</li>
								<li>нащупаешь, где детские стратегии мешают твоим взрослым отношениям</li>
								<li>выработаешь свои стратегии для создания любви и отношений</li>
							</ul>
							<div>
								В конце курса ты почувствуешь себя более целостно и у тебя будет в руках целый набор инструментов для управления эмоциями, а значит и своей жизнью!
							</div>
			      </div>
			    </div>
		      <div class="collapse" id="course_costs">
			      <div class="card card-body">
							<b>В курсе тебя ждет:</b>
							<ul class="square top">
								<li>6 видео уроков</li>
								<li class="homework">
									- инструменты для работы с эмоциями<br>
									- арт-терапевтические упражнения
								</li>
								<li>6 домашних заданий</li>
								<li>2 живых эфира с авторским разбором домашних заданий</li>
								<li>чат поддержки с участниками курса, где вы сможете обмениваться опытом,  делиться своими результатами, поддерживать друг друга и получать обратную связь 	от Татьяны</li>
								<li>1 неделя доступа к материалам</li>
							</ul>
							<b>ЭТОТ МИНИ-КУРС</b> поможет тебе узнать себя, научиться регулировать свои эмоции в пространстве единомышленников. Моя задача сделать эти 2 недели максимально понятными в теории и на практике. Вместе мы можем сделать результат.
							<br><br>
							<b>Старт мини-курса</b> - 17 декабря 2020
							Длительность - 2 недели,
							<br><br>
							<b>Тариф без обратной связи</b> - 1500 руб. В него входит 6 видео-уроков, 6 домашних заданий, 1 дополнительная неделя доступа к материалам
							<br><br>
							<b>Тариф с обратной связью</b> - 3500 руб. В него входит 6 видео-уроков, 6 домашних заданий, проверка домашних заданий, 2 прямых эфира 1 дополнительная неделя доступа к материалам
							<br><br>
						</div>
					</div>			    
		    </div>    
	    </div>        
		  <div class="col-12 col-lg-4">
		  	<img src="img/ocean.jpg" class='img-fluid'>
	  	</div>
		</div>
		</div>
	</div>
</template>
<script>
	export default {
	  data: () => ({
	  	menus: {
	  		general: false,
	  		menu: false,
	  		costs: false
	  	}
  	}),
		methods: {
			open_menu: function(curr_menu){
				for (let name in this.menus) {
					if(this.menus[name] == true) {
						document.getElementById("course_" + name).style = "display: none"
						this.menus[name] = false
						continue
					}

					if(name == curr_menu) {
						document.getElementById("course_" + name).style = "display: block"
						this.menus[name] = true
					} else {
						document.getElementById("course_" + name).style = "display: none"
					}
				}
			}  	
		}
	}	
</script>
<style scoped>
	h1{padding:0 20px;}
	h1:nth-child(1){padding-top:50px;}
	h1:nth-child(2){font-size:1.5rem;}
	ul{padding-left:35px;}
	button{margin:15px 20px 15px;height:2.7rem;}
	.list{padding:0 20px;}
	.social{margin-bottom:10px;padding:0 20px;}
	.social img{margin-right:10px;}
	.s-title{text-align:left;margin-bottom:20px;}
	.img-fluid{margin:0 20px;border-radius:25px;display:inline-block;}
	.collapse_container{padding:20px;}
	@media (max-width: 500px) {
		.img-fluid{width:90%;}
	}
	.cd{padding-top:10px;}
	.btn2{background:#FF4500;border:0px;}
	.homework{padding-top:0px;list-style-type:none;}
	.top{padding-top:10px;}
	.top li{padding-bottom:3px;}
</style>	