<!--NEXT Раздел "Обо мне"-->
<template>
	<div class="col-12 muted s-container">
		<div class="row">
			<div class="col-12 col-lg-1"></div>
		  <div class="col-12 col-lg-5">
		    <h1 class="s-title">Курс «ОКЕАН ЭМОЦИЙ»</h1>
		    <div class="list">
		    	Этот курс для тех, кто либо проглатывает эмоции, либо не сдерживает себя ни в чем:<br>
			    <ul class="square cd">
			      <li>Боитесь своих эмоций и не знайте как обходиться с ними?</li>
			      <li>Часто ваши действия определяют настроение, а не здравый смысл?</li>
			      <li>Находитесь в постоянном эмоциональном напряжении?</li>
			    </ul>
			    Именно для работы с эмоциями я создала авторский курс «Океан эмоций» где собрала свои знания и опыт, которые накопились у меня за 15 лет психологической практики.
		    </div>
			    <button class="btn btn-primary" type="button" data-toggle="collapse" data-target="#course_general" aria-expanded="false" aria-controls="collapseExample">
			      Узнать о курсе
			    </button>
			    <button class="btn btn-primary btn2" type="button" data-toggle="collapse" data-target="#course_menu" aria-expanded="false" aria-controls="collapseExample1">
			      Меню курса
			    </button>
		    <div class="collapse_container">  
			    <div class="collapse" id="course_general">
			      <div class="card card-body">
							Привыйно пытаешься сдержать свои эмоции, но потом ощущаешь усталость , подавленность, неудовлетворенность и даже обиду и злость. 
							<br><br>
							Ты замыкаешься в себе и уже не знаешь как иначе.<br>
							Бывает и так, что ты можешь не сдерживать эмоций, их становится в секунду очень много, и ты взрываешься и можешь накричать, поругаться а потом мучаться от вины и стыда.
							<br><br>
							Иногда, ты думаешь что твои сильные эмоции разжигают огонь  отношений, но со временем остаются одни угли из боли и разочарования.<br>
							Возможно, иногда ты замираешь и не знаешь, что сказать, теряешься, ощущаешь себя глупо и неловко.  
							<br><br>
							Ты либо проглатываешь эмоции, либо не сдерживаешь себя ни в чем. 
							<br><br>
							Тебе кажется, что ты такой эмоциональный никому не нужен и тебя все осуждают, поэтому отворачиваешься от мира.
							<br><br>
							Итог один: после ты чувствуешь дискомфорт и мир кажется тебе враждебным полным непонимания и несправедливости.
							<br><br>
							<b>Что же делать?</b>
							Как научиться понимать свои эмоции и регулировать их без вреда себе и своим отношениям???<br>
							Как улучшить ситуацию в отношениях с помощью эмоций?<br>
							Как ты можешь повлиять на свои эмоции??
							<br><br>
							Именно для работы с эмоциями я создала 
							курс «океан эмоций» где собрала свои знания и опыт, которые накопились у меня за 15 лет психологической практики.
							<br><br>
							<b>Моя задача помочь вам:</b>
							<ul class="square">
								<li>Научиться понимать и распознавать свои эмоции</li>
								<li>Быть в контакте со своими эмоциями</li>
								<li>Понимать, что эмоции делают для вас</li>
								<li>Останавливать нежелательные эмоции</li>
								<li>Снизить интенсивность эмоций и их продолжительность</li>
								<li>Снизить эмоциональную уязвимость в отношениях</li>
								<li>Научиться быстрее восстанавливаться после трудных ситуаций</li>
								<li>Научиться управлять сильными эмоциями</li>
							</ul>
							<br>

			      </div>
		      </div>
		      <div class="collapse" id="course_menu">
			      <div class="card card-body">
							<b>За 2 недели курса ты сможешь:</b>
							<ul class="square top">
								<li>получить инструменты по работе со сложными эмоциями такими как: страх, обида, злость и другими важными переживаниями</li>
								<li>поймешь природу своих эмоций</li>
								<li>узнаешь способы их регулирования</li>
								<li>сформулируешь новое поддерживающее себя эмоциональное поведение</li>
								<li>ощутишь опору внутри и силы влиять на свою жизнь</li>
								<li>сможешь устанавливать границы в отношениях благодаря способности понимать эмоциональные сигналы</li>
								<li>почувствуешь поддержку со стороны участников и кураторов курса</li>
							</ul>
							<b>Из чего состоит курс:</b>
							1. Знакомство с природой твоих эмоций
							<ul class="square">
								<li>какую роль играют эмоции в твоей жизни</li>
								<li>схема эмоционального цикла</li>
								<li>разберем мифы об эмоциях</li>
								<li class="homework"><i>Домашнее задание:</i><br>
								поможет тебе выработать здоровое отношение к эмоциям и ощутить, что ты способна изменить свои эмоциональные реакции</li>
							</ul>
							2. Изучаем эмоции и чувства
							<ul class="square">
								<li>какие чувства бывают и как их можно использовать для жизни</li>
								<li>устанавливаем контакт со своими чувствами</li>
								<li>ищем негативные установки относительно чувств</li>
								<li class="homework"><i>Домашнее задание:</i><br>
										Поможет тебе устанавливать контакт с чувствами и понимать их значение, тем самым создать опору и уверенность  внутри. Работаем с недоверием к себе. 
								</li>
							</ul>
							3. Ищем баланс между установками из головы и чувствами
							<ul class="square">
								<li>учимся определять разницу между мыслями и чувствами</li>
								<li>формируем ясную границы между моими чувствами и поступками других</li>
								<li>определяем, что хорошо для вас и учимся выражать экологично</li>
							
							<li class="homework"><i>Домашнее задание:</i><br>
							Поможет тебе увидеть как невыгодно быть «хорошей девочкой» научиться здоровым границам в выражении своих чувств. Устанавливать отношения без чувства стыда и вины.</li>
							</ul>
							4. Обнаруживаем проекции
							<ul class="square">
								<li>определяем, что вы не можете принять в себе</li>
								<li>что раздражает в других</li>
								<li>учимся видеть причины сильных чувств</li>
								<li>выстраиваем здоровое взаимодействие с отверженными частями своей личности</li>
								<li class="homework">
									<i>Домашнее задание:</i><br>
									Поможет вам успокоить внутренние бури эмоций, обиду, гнев, зависть. Увидеть в новом свете себя и других. Возможно поможет вам завершить или улучшить некоторые отношения.
								</li>
							</ul>
							5. Исследуем глубины океана эмоций
							<ul class="square">
								<li>обнаруживаем интроекты (установки)</li>
								<li>определяем , что из интроектов оставляем для дальнейшей жизни, а с чем прощаемся</li>
								<li>учимся брать только то, что нам подходит и нам помогает с радостью:))</li>
								<li class="homework">						
									<i>Домашнее задание:</i><br>
									Поможет вам ясно выражать свои потребности не подавляя эмоции и не выплескивая их на окружающих. Ощущать, что с помощью эмоций вы становитесь увереннее и сильнее
								</li>
							</ul>
							6. Самый мощный модуль работаем с эмоциями через сценарий жертва-спасатель-агрессор
							<ul class="square">
								<li>ты увидишь как роли треугольника создают динамику в твоей самооценке вниз-вверх, я дам модели выхода из эмоционального круга</li>
								<li>нащупаешь, где детские стратегии мешают твоим взрослым отношениям</li>
								<li>выработаешь свои стратегии для создания любви и отношений</li>
								<li class="homework">
									<i>Домашнее задание:</i><br>
									Поможет тебе увидеть какие роли ты играешь, стратегии ограничивающие тебя от близости с другими. Научиться при помощи эмоций распознавать роли, отказываться от отношений с манипуляцией и вовремя говорить НЕТ неподходящему влиянию. 
								</li>
							</ul>
							<div>
								В конце курса ты почувствуешь себя более целостно и у тебя будет в руках целый набор инструментов для управления эмоциями, а значит и своей жизнью!
							</div>
			      </div>
			    </div>
		    </div>    
	    </div>        
		  <div class="col-12 col-lg-4">
		  	<img src="img/tanya.png" class='img-fluid'>
	  	</div>
		</div>
		</div>
	</div>
</template>
<style scoped>
	h1{padding:0 20px;}
	h1:nth-child(1){padding-top:50px;}
	h1:nth-child(2){font-size:1.5rem;}
	ul{padding-left:35px;}
	button{margin:15px 20px 15px;height:2.7rem;}
	.list{padding:0 20px;}
	.social{margin-bottom:10px;padding:0 20px;}
	.social img{margin-right:10px;}
	.s-title{text-align:left;margin-bottom:20px;}
	.img-fluid{margin:0 20px;border-radius:25px;display:inline-block;}
	.collapse_container{padding:20px;}
	@media (max-width: 500px) {
		.img-fluid{width:90%;}
	}
	.cd{padding-top:10px;}
	.btn2{background:#FF4500;border:0px;}
	.homework{padding-top:8px;list-style-type:none;}
	.top{padding-top:10px;}
	.top li{padding-bottom:3px;}
</style>	