<template>
  <!--NEXT Цель "Что говорят мои клиенты"-->
  <div class="col-md-12 b-even goal-clients">
      <div class="row">
        <div class="col-md-2"></div>
        <div class="col-md-8">
          <h1 class="text-center mb-5">Отзывы моих клиентов</h1>
          <div class="row">
            <div class="col-md-6">
              <div class="embed-responsive embed-responsive-16by9">
                <iframe class="embed-responsive-item" src="https://www.youtube.com/embed/O1gkycoOydY"></iframe>
              </div>
            </div>
            <div class="col-md-6">
              <div class="embed-responsive embed-responsive-16by9">
                <iframe class="embed-responsive-item" src="https://www.youtube.com/embed/UjaH_JYkpE4"></iframe>
              </div>
            </div>
          </div>
          <div class="row">
            <!--NEXT Отзыв 1-->
            <div class="col-md-6">
              <div class="card">
                <div class="content">
                  <span class="title">Алёна, 35 лет</span>
                  <p>
                    В апреле 2017 года я обратилась за психологической помощью и поддержкой к Татьяне Гвоздовской. В то время я переживала
                    очень непростой период в своей жизни - переезд в другую страну, свадьба с иностранцем, новая работа.
                  </p>
                  <template v-if="reviews[0].content">
                    <p>Было столько всего нового и непривычного мне,
                    что я сама не справлялась с эмоциями, были постоянные ссоры с мужем, я часто плакала, хотелось всё бросить и вернуться назад.</p>
                    <p>Поэтому я решила помочь самой себе, чтобы не сойти с ума, я обратилась к Тане. На сессиях была очень доверительная и безопасная атмосфера,
                    которая помогла мне раскрыться, оглядеться внутри себя, расставить свои границы и приоритеты, увидеть свои страхи.</p>
                    <p>Терапия - это не то, что тебя погладят по головке и дадут конфетку, нет, это работа 24 на 7, когда хочется уже сказать себе - хватит,
                    больше не хочу чувствовать и думать, но нет - процесс идёт, и такой кайф, когда я начала видеть причины и следствия своих
                    переживаний и поступков, иногда хотелось сказать - бе, это не моё, это не я, но потом это "бе" становилось родным и близким, так приходит
                    принятие себя со всеми белыми и чёрными пятнами.</p>
                    <p>Был период, когда мне казалось, ну теперь я разобралась со всем, и хотелось закончить терапию,
                    но с этого, пожалуй, началась самая серьёзная работа. Я научилась прислушиваться к себе, слышать себя и доверять себе.</p>
                    <p>Для меня терапия с Таней - это знакомство с самой собой без той шулухи, которую нам навязывают социумом, а родители
                    с детства вбивают в голову, принятие себя, не смотря на то, что кому-то это не нравится или не принято. Самое простое и самое сложное для меня - 
                    это быть честной с самой собой.</p>
                  </template>
                  </p>
                </div>
                <div class="action">
                  <a href="#" @click="open_card(0)" v-if="reviews[0].link1">Читать полностью</a>
                  <a href="#" @click="close_card(0)" v-if="reviews[0].link2">Скрыть историю</a>
                </div>
              </div>                      
            </div>
            <!--NEXT Отзыв 2-->
            <div class="col-md-6">
              <div class="card">
                <div class="content">
                  <span class="title">Наталья</span>
                  <p>
                    Я неоднократно обращалась за помощью к психологу Татьяне Гвоздовской.
                    В определённый момент я поняла, что мне нужна помощь специалиста, потому что сама я не могла справиться. 
                    Не видела "корня зла" ситуации, не понимала, что делать дальше. 
                  </p>
                  <template v-if="reviews[1].content">
                    <p>
                      И мне нужна была просто человеческая поддержка. Этого достаточно иногда для того, чтобы разобраться и справиться с задачей,
                      которая сначала кажется глобальной и непостижимой, а потом, после работы с психологом, вдруг оказывается несложной и ясной.
                    </p>
                    <p>
                      Таня подсказывала некие инструменты, с помощью которых я могла решать сложные ситуации самостоятельно вне кабинета.
                      Это было довольно действенно. Даже если я не была уверена в себе, я могла опереться на эти независимо и объективно существующие
                      и действующие механизмы и двигаться дальше.
                    </p>
                    <p>
                      Мне удалось разрешить ряд внутренних проблем и внешних конфликтов с ближним окружением людей и родными.
                      Я обязательно рекомендую обращаться за помощью к психологу и психотерапевту, когда: есть ощущение, что ходишь по кругу,
                      а проблема не решается; нет эмоциональных сил на то, чтобы все решить в одиночку и нужна поддержка; все понятно и не знаешь,
                      где правда, где ложь, а ситуацию терпеть больше не можешь и не хочешь. 
                    </p>
                    <p>
                      Все эти задачи я смогла решить благодаря Таниной поддержке и профессиональной помощи. Конечно, я с удовольствием обращусь к ней за
                      консультацией впредь, если что-то пойдёт не так.
                    </p>
                  </template>
                  </p>
                </div>
                <div class="action">
                  <a href="#" @click="open_card(1)" v-if="reviews[1].link1">Читать полностью</a>
                  <a href="#" @click="close_card(1)" v-if="reviews[1].link2">Скрыть историю</a>
                </div>
              </div>                      
            </div>
          </div>
        </div>
        <div class="col-md-2"></div>
      </div>
      <MyComponent />
  </div>
</template>

<script>
export default {
  data: () => ({
    reviews: [
      { content:false, link1:true, link2:false },
      { content:false, link1:true, link2:false }
    ]
  }),
  methods: {
    open_card: function(number) {
      console.log(this.reviews[0].content)
      this.reviews[number].content=true
      this.reviews[number].link1=false
      this.reviews[number].link2=true
    },
    close_card: function(number) {
      this.reviews[number].content=false
      this.reviews[number].link1=true
      this.reviews[number].link2=false
    }
  }
}
</script>
<style>
.goal-clients .card{padding:15px;margin-top:30px;border-radius:8px;}
.goal-clients .card .title{font-size:1.6rem;}
.goal-clients .more{}
</style>