export const educationHistory = [
  {
    type: "Повышение квалификации",
    title: "Психологическое консультирование и психотерапия клиентов с сексуальными дисфункциями",
    period: "2013",
    location: "Москва, Институт практической психологии и психоанализа",
  },
  {
    type: "Повышение квалификации",
    title: "Гешталь-подход в области психологического консультирования",
    period: "2011",
    location: "Москва, Институт современных психологических технологий",
  },
  {
    type: "Повышение квалификации",
    title: "Арт-терапия: разнообразие подходов",
    period: "2010-2011",
    location: "Москва, Институт современных психологических технологий",
  },
  {
    type: "Повышение квалификации",
    title: "Снятие учебного и рабочего стресса",
    period: "2010",
    location: "Москва, Психолого-педагогический университет",
  },
  {
    type: "Профессиональная переподготовка",
    title: "Современные методы психологической коррекции и консультирование",
    period: "2005 - 2008",
    location: "Москва, Институт современных психологических технологий",
  },
  {
    type: "Высшее образование",
    title: "Диплом Психолог. Преподаватель психологии.",
    period: "2000 - 2005",
    location: "Воронеж, Экономико-Правовой институт",
  },
];
