export const QUESTIONS = [
  {
    content:
      "Я склонен/склонна брать на себя ответственность за чувства и/или поведение других людей",
  },
  {
    content:
      "Я затрудняюсь идентифицировать свои чувства, такие как счастье, злость, смущение, уныние или возбуждение",
  },
  { content: "Мне тяжело выражать свои чувства" },
  {
    content:
      "Я испытываю страх или беспокойство при мысли о том, как другие отреагируют на мои чувства или поведение",
  },
  {
    content:
      "Я свожу к минимуму проблемы и отрицаю или изменяю правду о чувствах или поведении людей, с которыми общаюсь",
  },
  {
    content: "Мне трудно устанавливать или поддерживать тесные взаимоотношения",
  },
  { content: "Я боюсь быть отвергнутым (отвергнутой)" },
  { content: "Я стараюсь добиваться во всем совершенства и сужу себя строго" },
  { content: "Мне трудно принимать решения" },
  {
    content:
      "Я склонен (склонна) полагаться на мнения других, а не действовать по своему усмотрению",
  },
  {
    content:
      "Я склонен (склонна) ставить желания и потребности других людей на первый план",
  },
  {
    content:
      "Я склонен (склонна) ценить мнение других людей выше своего собственного",
  },
  {
    content:
      "Мое ощущение собственного достоинства идет извне, в зависимости от мнения или действий других людей, которые, как мне кажется, больше в этом разбираются",
  },
  {
    content: "Я нахожу, что тяжело быть уязвимым (уязвимой) и просить о помощи",
  },
  {
    content:
      "Я всегда подвергаюсь контролю или стремлюсь контролировать, и наоборот, всегда слежу за тем, чтобы никогда не оказаться ответственным (ответственной)",
  },
  {
    content:
      "Я слишком лоялен (лояльна) к другим, даже в том случае, когда эта лояльность не оправдывается",
  },
  {
    content:
      "У меня привычка рассматривать ситуации по принципу 'все или ничего'",
  },
  {
    content:
      "Я очень толерантен (толерантна) к непоследовательности и смешанным поручениям",
  },
  { content: "В моей жизни происходят эмоциональные кризисы и хаос" },
  {
    content:
      "Я стараюсь искать взаимоотношения там, где чувствую себя “нужным” (“нужной”), и пытаюсь затем сохранять их",
  },
];
